#email netcat socket smtp pop pop3

HELO smtp.domain.com
MAIL FROM:<alice@hacker.com>
RCPT TO:<bob@secure.net>
DATA
From: [Alice Hacker] <alice@hacker.com>
   To: [Bob Smith] <bob@secure.net>
   Date: Mon, 12 Apr 2010 14:21:26 -0400
   Subject: Test Message

   Hi there!
   This is supposed to be a real email...

   Have a good day!
   Alice


   .
 QUIT


POP3


Command	Description	Example
USER [username]	1st login command	USER Stan
+OK Please enter a password
PASS [password]	2nd login command	PASS SeCrEt
+OK valid logon
QUIT	Logs out and saves any changes	QUIT
+OK Bye-bye.
STAT	Returns total number of messages and total size	STAT
+OK 2 320
LIST	Lists all messages	LIST
+OK 2 messages (320 octets)
1 120
2 200
â€¦
LIST 2
+OK 2 200
RETR [message]	Retrieves the whole message	RETR 1
+OK 120 octets follow.
***
DELE [message]	Deletes the specified message	DELE 2
+OK message deleted
NOOP	The POP3 server does nothing, it merely replies with a positive response.	NOOP
+OK
RSET	Undelete the message if any marked for deletion	RSET
+OK maildrop has 2 messages (320 octets)
TOP [message] [number]	Returns the headers and number of lines from the message	TOP 1 10
+OK
***

#Kali Utility for sending emails from command line:
sendEmail -t user@domain -f sender@domain -u "email issues" -a test3.hta -s 192.168.92.159:25 -m "Hey dude?" -vv -o fqdn=mail.domain.com
